app/views/main/index.html.erb

SELECT COUNT(*) FROM "contacts"  WHERE "contacts"."city_id" = ?  [["city_id", 1]]
SELECT SUM("contacts"."objects") AS sum_id FROM "contacts"  WHERE "contacts"."city_id" = ?  [["city_id", 1]]
---

        <td><%= city.contacts.count %></td>
        <td><%= city.contacts.sum(:objects) %></td>