app/views/root/index.html.erb

SELECT SUM("contacts"."objects") AS sum_id FROM "contacts"  WHERE "contacts"."city_id" = 1
---
        <td><%= city.contacts.count %></td>
        <td><%= city.contacts.sum(:objects) %></td>