app/views/root/index.html.erb

SELECT "contacts".* FROM "contacts"
SELECT COUNT(*) FROM "contacts"  WHERE "contacts"."city_id" = ?  [["city_id", 2]]
SELECT SUM("contacts"."number") AS sum_id FROM "contacts"  WHERE "contacts"."city_id" = 1
---

        <td><%= city.contacts.count %></td>
        <td><%= city.contacts.sum(:number) %></td>