app/controllers/cities_controller.rb

INSERT INTO "cities" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-07-31 19:23:49.023077"], ["name", "Kraków"], ["updated_at", "2014-07-31 19:23:49.023077"]]
---
  def create
    @city = City.new(city_params)
    if @city.save

UPDATE "cities" SET "name" = ?, "updated_at" = ? WHERE "cities"."id" = 1  [["name", "Warszawa 1"], ["updated_at", "2014-07-31 19:37:22.820080"]]
---
  def update
    if @city.update(city_params)

DELETE FROM "cities" WHERE "cities"."id" = ?  [["id", 3]]
---
  def destroy
    @city.destroy