app/controllers/contacts_controller.rb

INSERT INTO "cities" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-08-06 21:49:36.242468"], ["name", "Ostróda"], ["updated_at", "2014-08-06 21:49:36.242468"]]
INSERT INTO "contacts" ("city_id", "created_at", "number", "objects", "updated_at") VALUES (?, ?, ?, ?, ?)  [["city_id", 2], ["created_at", "2014-08-01 16:31:19.354765"], ["number", 1], ["objects", 1], ["updated_at", "2014-08-01 16:31:19.354765"]]
SELECT  "cities".* FROM "cities"  WHERE "cities"."name" IS NULL  ORDER BY "cities"."id" DESC LIMIT 1
---
  def create

    @city = City.find_or_create_by(name: (params[:contact][:city_id]))