app/controllers/main_controller.rb

  def index
    @cities = City.all
    #@cont = Contact.all

    # #wersja brzydsza
    # @cities.to_a.sort! { |x,y| y.contacts.count <=> x.contacts.count }

    #wersja ładniejsza
    @cities = City.joins(:contacts).group(Contact.arel_table[:city_id]).
         order(Contact.arel_table[:city_id].count).reverse
     @cities = Kaminari.paginate_array(@cities).page(params[:page]).per(10)
---
SELECT "cities".* FROM "cities" INNER JOIN "contacts" ON "contacts"."city_id" = "cities"."id" GROUP BY "contacts"."city_id"  ORDER BY COUNT("contacts"."city_id")
SELECT COUNT(*) FROM "contacts"  WHERE "contacts"."city_id" = ?  [["city_id", 1]]