app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("admin", "created_at", "email", "name", "password", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["admin", "t"], ["created_at", "2014-08-01 17:53:21.798131"], ["email", "gos@pl"], ["name", "gosia"], ["password", "lowe12"], ["updated_at", "2014-08-01 17:53:21.798131"]]

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "email" = ?, "password" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["email", "gos@pl.pl"], ["password", "lowe"], ["updated_at", "2014-08-01 17:55:51.121491"]]